// 문자열

// 브라우저 개발자 도구 이용함
'Hello, world!';
"Hello, world!";

typeof 'Hello, world!';

typeof '';

'' == ' ';

// '문자열 안에 작은따옴표(')가 있어요';
"문자열 안에 작은따옴표(')가 있어요";
'문자열 안에 큰따옴표(")가 있어요';
"문자열 안에 큰따옴표(\")가 있어요";
'문자열 안에 작은따옴표(\')가 있어요';
'문자열 안에 백슬래시(\\)가 있어요';

// 템플릿 리터럴 `(백틱) 사용
`저도 문자열 입니다.`;
`문자열 안에 백틱(\`)이 있어요.`;

// 문자열 합치기
'문자열이 긴 경우에는 문자열을 ' + '나눈 뒤 다시 합칩니다.';
'문자열이 긴 경우에는 ' + '문자열을 ' + '나눈 뒤 ' + '다시 합칩니다.';

// 1분 퀴즈
'문자열이 긴 경우에는 '+' 문자열을 '+' 나눈 뒤 '+'다시 합칩니다.';
